# Найти минимальный элемент списка самым быстрым способом

a = list(map(int,input("Введите элементв списка : ").strip().split()))
print(f"Минимальный элемент: {min(a)}")